Script started on 2019-09-05 15:00:29-04:00 [TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="80" LINES="24"]
rimai1@g7-33:/import/linux/home1/rimai1/git-repos/i220b/work/lab3$ ls
lab3.log
rimai1@g7-33:/import/linux/home1/rimai1/git-repos/i220b/work/lab3$ cd ..
rimai1@g7-33:/import/linux/home1/rimai1/git-repos/i220b/work$ cd ..
rimai1@g7-33:/import/linux/home1/rimai1/git-repos/i220b$ cd ..[K[K[K[K[Kcd /
rimai1@g7-33:/$ ls
backup	    initrd.img		    mnt			 srv
bin	    initrd.img.old	    nslcd.conf.linux	 sys
boot	    lib			    opt			 tmp
dev	    lib32		    opt.local		 usr
etc	    lib64		    opt.old		 var
home	    libnss-ldap.conf.linux  pam_ldap.conf.linux  vmlinuz
home1	    libx32		    proc		 vmlinuz.old
home.local  lost+found		    root
home.save   media		    run
import	    microchip		    sbin
rimai1@g7-33:/$ cd ~
rimai1@g7-33:~$ ls
a.out		 bin-c.log  dir		    i220b	   Pictures	v1.s
Arduino		 cat.lo     Documents	    lab2	   Public	v.c
array.asm	 cat.log    Downloads	    ls.log	   T1.s		Videos
assembler-lab	 cs120	    git-repos	    manyHello.asm  Templates	x.c
assembler-lab.c  cs220	    HelloWorld	    mipsAsm.asm    tinyproc2.s
BillGates.asm	 Desktop    HelloWorld.asm  Music	   tl.c
rimai1@g7-33:~$ cd cs220
rimai1@g7-33:~/cs220$ ls
lab1.txt
rimai1@g7-33:~/cs220$ cd ,.[K[K..
rimai1@g7-33:~$ cd u[Ki220b
rimai1@g7-33:~/i220b$ ls
README.md  submit  work
rimai1@g7-33:~/i220b$ cd [K[K[Kcd ..
rimai1@g7-33:~$ cd git-repos
rimai1@g7-33:~/git-repos$ ls
cs220  i220b
rimai1@g7-33:~/git-repos$ cd [K cs220
rimai1@g7-33:~/git-repos/cs220$ ls
announce.html  bin   exams-quizzes  index.umt  misc	  slides
announce.umt   docs  hws	    labs       projects
assets	       ex    index.html     Makefile   README.md
rimai1@g7-33:~/git-repos/cs220$ cd labs
rimai1@g7-33:~/git-repos/cs220/labs$ cd ..[K[K[K[K[Kls
index.html  index.umt  lab1  lab2  lab-tips  Makefile
rimai1@g7-33:~/git-repos/cs220/labs$ [Krimai1@g7-33:~/git-repos/cs220/labs$ [Krimai1@g7-33:~/git-repos/cs220/labs$ [Krimai1@g7-33:~/git-repos/cs220/labs$ [Krimai1@g7-33:~/git-repos/cs220/labs$ [Krimai1@g7-33:~/git-repos/cs220/labs$ [Krimai1@g7-33:~/git-repos/cs220/labs$ [Krimai1@g7-33:~/git-repos/cs220/labs$ cd ll[Ks[Kss[K [K[K[Klab2
rimai1@g7-33:~/git-repos/cs220/labs/lab2$ ls
files  lab2.html  lab2.pdf  lab2.umt  Makefile
rimai1@g7-33:~/git-repos/cs220/labs/lab2$ cd [K[K[Kc[Kd [K[Kcd [K[K[Ks[Kcd ..
rimai1@g7-33:~/git-repos/cs220/labs$ clear
[H[2J[3Jrimai1@g7-33:~/git-repos/cs220/labs$ ls
index.html  index.umt  lab1  lab2  lab-tips  Makefile
rimai1@g7-33:~/git-repos/cs220/labs$ git pull
Warning: Permanently added the ECDSA host key for IP address '128.226.114.202' to the list of known hosts.
rimai1@remote.cs.binghamton.edu's password: 
remote: Enumerating objects: 241, done.[K
remote: Counting objects:   0% (1/241)   [Kremote: Counting objects:   1% (3/241)   [Kremote: Counting objects:   2% (5/241)   [Kremote: Counting objects:   3% (8/241)   [Kremote: Counting objects:   4% (10/241)   [Kremote: Counting objects:   5% (13/241)   [Kremote: Counting objects:   6% (15/241)   [Kremote: Counting objects:   7% (17/241)   [Kremote: Counting objects:   8% (20/241)   [Kremote: Counting objects:   9% (22/241)   [Kremote: Counting objects:  10% (25/241)   [Kremote: Counting objects:  11% (27/241)   [Kremote: Counting objects:  12% (29/241)   [Kremote: Counting objects:  13% (32/241)   [Kremote: Counting objects:  14% (34/241)   [Kremote: Counting objects:  15% (37/241)   [Kremote: Counting objects:  16% (39/241)   [Kremote: Counting objects:  17% (41/241)   [Kremote: Counting objects:  18% (44/241)   [Kremote: Counting objects:  19% (46/241)   [Kremote: Counting objects:  20% (49/241)   [Kremote: Counting objects:  21% (51/241)   [Kremote: Counting objects:  22% (54/241)   [Kremote: Counting objects:  23% (56/241)   [Kremote: Counting objects:  24% (58/241)   [Kremote: Counting objects:  25% (61/241)   [Kremote: Counting objects:  26% (63/241)   [Kremote: Counting objects:  27% (66/241)   [Kremote: Counting objects:  28% (68/241)   [Kremote: Counting objects:  29% (70/241)   [Kremote: Counting objects:  30% (73/241)   [Kremote: Counting objects:  31% (75/241)   [Kremote: Counting objects:  32% (78/241)   [Kremote: Counting objects:  33% (80/241)   [Kremote: Counting objects:  34% (82/241)   [Kremote: Counting objects:  35% (85/241)   [Kremote: Counting objects:  36% (87/241)   [Kremote: Counting objects:  37% (90/241)   [Kremote: Counting objects:  38% (92/241)   [Kremote: Counting objects:  39% (94/241)   [Kremote: Counting objects:  40% (97/241)   [Kremote: Counting objects:  41% (99/241)   [Kremote: Counting objects:  42% (102/241)   [Kremote: Counting objects:  43% (104/241)   [Kremote: Counting objects:  44% (107/241)   [Kremote: Counting objects:  45% (109/241)   [Kremote: Counting objects:  46% (111/241)   [Kremote: Counting objects:  47% (114/241)   [Kremote: Counting objects:  48% (116/241)   [Kremote: Counting objects:  49% (119/241)   [Kremote: Counting objects:  50% (121/241)   [Kremote: Counting objects:  51% (123/241)   [Kremote: Counting objects:  52% (126/241)   [Kremote: Counting objects:  53% (128/241)   [Kremote: Counting objects:  54% (131/241)   [Kremote: Counting objects:  55% (133/241)   [Kremote: Counting objects:  56% (135/241)   [Kremote: Counting objects:  57% (138/241)   [Kremote: Counting objects:  58% (140/241)   [Kremote: Counting objects:  59% (143/241)   [Kremote: Counting objects:  60% (145/241)   [Kremote: Counting objects:  61% (148/241)   [Kremote: Counting objects:  62% (150/241)   [Kremote: Counting objects:  63% (152/241)   [Kremote: Counting objects:  64% (155/241)   [Kremote: Counting objects:  65% (157/241)   [Kremote: Counting objects:  66% (160/241)   [Kremote: Counting objects:  67% (162/241)   [Kremote: Counting objects:  68% (164/241)   [Kremote: Counting objects:  69% (167/241)   [Kremote: Counting objects:  70% (169/241)   [Kremote: Counting objects:  71% (172/241)   [Kremote: Counting objects:  72% (174/241)   [Kremote: Counting objects:  73% (176/241)   [Kremote: Counting objects:  74% (179/241)   [Kremote: Counting objects:  75% (181/241)   [Kremote: Counting objects:  76% (184/241)   [Kremote: Counting objects:  77% (186/241)   [Kremote: Counting objects:  78% (188/241)   [Kremote: Counting objects:  79% (191/241)   [Kremote: Counting objects:  80% (193/241)   [Kremote: Counting objects:  81% (196/241)   [Kremote: Counting objects:  82% (198/241)   [Kremote: Counting objects:  83% (201/241)   [Kremote: Counting objects:  84% (203/241)   [Kremote: Counting objects:  85% (205/241)   [Kremote: Counting objects:  86% (208/241)   [Kremote: Counting objects:  87% (210/241)   [Kremote: Counting objects:  88% (213/241)   [Kremote: Counting objects:  89% (215/241)   [Kremote: Counting objects:  90% (217/241)   [Kremote: Counting objects:  91% (220/241)   [Kremote: Counting objects:  92% (222/241)   [Kremote: Counting objects:  93% (225/241)   [Kremote: Counting objects:  94% (227/241)   [Kremote: Counting objects:  95% (229/241)   [Kremote: Counting objects:  96% (232/241)   [Kremote: Counting objects:  97% (234/241)   [Kremote: Counting objects:  98% (237/241)   [Kremote: Counting objects:  99% (239/241)   [Kremote: Counting objects: 100% (241/241)   [Kremote: Counting objects: 100% (241/241), done.[K
remote: Compressing objects:   0% (1/120)   [Kremote: Compressing objects:   1% (2/120)   [Kremote: Compressing objects:   2% (3/120)   [Kremote: Compressing objects:   3% (4/120)   [Kremote: Compressing objects:   4% (5/120)   [Kremote: Compressing objects:   5% (6/120)   [Kremote: Compressing objects:   6% (8/120)   [Kremote: Compressing objects:   7% (9/120)   [Kremote: Compressing objects:   8% (10/120)   [Kremote: Compressing objects:   9% (11/120)   [Kremote: Compressing objects:  10% (12/120)   [Kremote: Compressing objects:  11% (14/120)   [Kremote: Compressing objects:  12% (15/120)   [Kremote: Compressing objects:  13% (16/120)   [Kremote: Compressing objects:  14% (17/120)   [Kremote: Compressing objects:  15% (18/120)   [Kremote: Compressing objects:  16% (20/120)   [Kremote: Compressing objects:  17% (21/120)   [Kremote: Compressing objects:  18% (22/120)   [Kremote: Compressing objects:  19% (23/120)   [Kremote: Compressing objects:  20% (24/120)   [Kremote: Compressing objects:  21% (26/120)   [Kremote: Compressing objects:  22% (27/120)   [Kremote: Compressing objects:  23% (28/120)   [Kremote: Compressing objects:  24% (29/120)   [Kremote: Compressing objects:  25% (30/120)   [Kremote: Compressing objects:  26% (32/120)   [Kremote: Compressing objects:  27% (33/120)   [Kremote: Compressing objects:  28% (34/120)   [Kremote: Compressing objects:  29% (35/120)   [Kremote: Compressing objects:  30% (36/120)   [Kremote: Compressing objects:  31% (38/120)   [Kremote: Compressing objects:  32% (39/120)   [Kremote: Compressing objects:  33% (40/120)   [Kremote: Compressing objects:  34% (41/120)   [Kremote: Compressing objects:  35% (42/120)   [Kremote: Compressing objects:  36% (44/120)   [Kremote: Compressing objects:  37% (45/120)   [Kremote: Compressing objects:  38% (46/120)   [Kremote: Compressing objects:  39% (47/120)   [Kremote: Compressing objects:  40% (48/120)   [Kremote: Compressing objects:  41% (50/120)   [Kremote: Compressing objects:  42% (51/120)   [Kremote: Compressing objects:  43% (52/120)   [Kremote: Compressing objects:  44% (53/120)   [Kremote: Compressing objects:  45% (54/120)   [Kremote: Compressing objects:  46% (56/120)   [Kremote: Compressing objects:  47% (57/120)   [Kremote: Compressing objects:  48% (58/120)   [Kremote: Compressing objects:  49% (59/120)   [Kremote: Compressing objects:  50% (60/120)   [Kremote: Compressing objects:  51% (62/120)   [Kremote: Compressing objects:  52% (63/120)   [Kremote: Compressing objects:  53% (64/120)   [Kremote: Compressing objects:  54% (65/120)   [Kremote: Compressing objects:  55% (66/120)   [Kremote: Compressing objects:  56% (68/120)   [Kremote: Compressing objects:  57% (69/120)   [Kremote: Compressing objects:  58% (70/120)   [Kremote: Compressing objects:  59% (71/120)   [Kremote: Compressing objects:  60% (72/120)   [Kremote: Compressing objects:  61% (74/120)   [Kremote: Compressing objects:  62% (75/120)   [Kremote: Compressing objects:  63% (76/120)   [Kremote: Compressing objects:  64% (77/120)   [Kremote: Compressing objects:  65% (78/120)   [Kremote: Compressing objects:  66% (80/120)   [Kremote: Compressing objects:  67% (81/120)   [Kremote: Compressing objects:  68% (82/120)   [Kremote: Compressing objects:  69% (83/120)   [Kremote: Compressing objects:  70% (84/120)   [Kremote: Compressing objects:  71% (86/120)   [Kremote: Compressing objects:  72% (87/120)   [Kremote: Compressing objects:  73% (88/120)   [Kremote: Compressing objects:  74% (89/120)   [Kremote: Compressing objects:  75% (90/120)   [Kremote: Compressing objects:  76% (92/120)   [Kremote: Compressing objects:  77% (93/120)   [Kremote: Compressing objects:  78% (94/120)   [Kremote: Compressing objects:  79% (95/120)   [Kremote: Compressing objects:  80% (96/120)   [Kremote: Compressing objects:  81% (98/120)   [Kremote: Compressing objects:  82% (99/120)   [Kremote: Compressing objects:  83% (100/120)   [Kremote: Compressing objects:  84% (101/120)   [Kremote: Compressing objects:  85% (102/120)   [Kremote: Compressing objects:  86% (104/120)   [Kremote: Compressing objects:  87% (105/120)   [Kremote: Compressing objects:  88% (106/120)   [Kremote: Compressing objects:  89% (107/120)   [Kremote: Compressing objects:  90% (108/120)   [Kremote: Compressing objects:  91% (110/120)   [Kremote: Compressing objects:  92% (111/120)   [Kremote: Compressing objects:  93% (112/120)   [Kremote: Compressing objects:  94% (113/120)   [Kremote: Compressing objects:  95% (114/120)   [Kremote: Compressing objects:  96% (116/120)   [Kremote: Compressing objects:  97% (117/120)   [Kremote: Compressing objects:  98% (118/120)   [Kremote: Compressing objects:  99% (119/120)   [Kremote: Compressing objects: 100% (120/120)   [Kremote: Compressing objects: 100% (120/120), done.[K
Receiving objects:   0% (1/187)   Receiving objects:   1% (2/187)   Receiving objects:   2% (4/187)   Receiving objects:   3% (6/187)   Receiving objects:   4% (8/187)   Receiving objects:   5% (10/187)   Receiving objects:   6% (12/187)   Receiving objects:   7% (14/187)   Receiving objects:   8% (15/187)   Receiving objects:   9% (17/187)   Receiving objects:  10% (19/187)   Receiving objects:  11% (21/187)   Receiving objects:  12% (23/187)   Receiving objects:  13% (25/187)   Receiving objects:  14% (27/187)   Receiving objects:  15% (29/187)   Receiving objects:  16% (30/187)   Receiving objects:  17% (32/187)   Receiving objects:  18% (34/187)   Receiving objects:  19% (36/187)   Receiving objects:  20% (38/187)   Receiving objects:  21% (40/187)   Receiving objects:  22% (42/187)   Receiving objects:  23% (44/187)   Receiving objects:  24% (45/187)   Receiving objects:  25% (47/187)   Receiving objects:  26% (49/187)   Receiving objects:  27% (51/187)   Receiving objects:  28% (53/187)   Receiving objects:  29% (55/187)   Receiving objects:  30% (57/187)   Receiving objects:  31% (58/187)   Receiving objects:  32% (60/187)   Receiving objects:  33% (62/187)   Receiving objects:  34% (64/187)   Receiving objects:  35% (66/187)   Receiving objects:  36% (68/187)   Receiving objects:  37% (70/187)   Receiving objects:  38% (72/187)   Receiving objects:  39% (73/187)   Receiving objects:  40% (75/187)   Receiving objects:  41% (77/187)   Receiving objects:  42% (79/187)   Receiving objects:  43% (81/187)   Receiving objects:  44% (83/187)   Receiving objects:  45% (85/187)   Receiving objects:  46% (87/187)   Receiving objects:  47% (88/187)   Receiving objects:  48% (90/187)   Receiving objects:  49% (92/187)   Receiving objects:  50% (94/187)   Receiving objects:  51% (96/187)   Receiving objects:  52% (98/187)   Receiving objects:  53% (100/187)   Receiving objects:  54% (101/187)   Receiving objects:  55% (103/187)   Receiving objects:  56% (105/187)   Receiving objects:  57% (107/187)   Receiving objects:  58% (109/187)   Receiving objects:  59% (111/187)   Receiving objects:  60% (113/187)   Receiving objects:  61% (115/187)   Receiving objects:  62% (116/187)   Receiving objects:  63% (118/187)   Receiving objects:  64% (120/187)   Receiving objects:  65% (122/187)   Receiving objects:  66% (124/187)   Receiving objects:  67% (126/187)   Receiving objects:  68% (128/187)   Receiving objects:  69% (130/187)   Receiving objects:  70% (131/187)   Receiving objects:  71% (133/187)   Receiving objects:  72% (135/187)   Receiving objects:  73% (137/187)   Receiving objects:  74% (139/187)   Receiving objects:  75% (141/187)   Receiving objects:  76% (143/187)   Receiving objects:  77% (144/187)   Receiving objects:  78% (146/187)   Receiving objects:  79% (148/187)   Receiving objects:  80% (150/187)   Receiving objects:  81% (152/187)   Receiving objects:  82% (154/187)   Receiving objects:  83% (156/187)   Receiving objects:  84% (158/187)   Receiving objects:  85% (159/187)   Receiving objects:  86% (161/187)   Receiving objects:  87% (163/187)   Receiving objects:  88% (165/187)   Receiving objects:  89% (167/187)   Receiving objects:  90% (169/187)   Receiving objects:  91% (171/187)   Receiving objects:  92% (173/187)   Receiving objects:  93% (174/187)   Receiving objects:  94% (176/187)   Receiving objects:  95% (178/187)   Receiving objects:  96% (180/187)   Receiving objects:  97% (182/187)   Receiving objects:  98% (184/187)   remote: Total 187 (delta 114), reused 108 (delta 62)[K
Receiving objects:  99% (186/187)   Receiving objects: 100% (187/187)   Receiving objects: 100% (187/187), 274.12 KiB | 6.37 MiB/s, done.
Resolving deltas:   0% (0/114)   Resolving deltas:   4% (5/114)   Resolving deltas:   5% (6/114)   Resolving deltas:   7% (8/114)   Resolving deltas:   9% (11/114)   Resolving deltas:  10% (12/114)   Resolving deltas:  12% (14/114)   Resolving deltas:  14% (16/114)   Resolving deltas:  16% (19/114)   Resolving deltas:  17% (20/114)   Resolving deltas:  18% (21/114)   Resolving deltas:  19% (22/114)   Resolving deltas:  20% (23/114)   Resolving deltas:  21% (24/114)   Resolving deltas:  22% (26/114)   Resolving deltas:  23% (27/114)   Resolving deltas:  24% (28/114)   Resolving deltas:  25% (29/114)   Resolving deltas:  26% (30/114)   Resolving deltas:  27% (31/114)   Resolving deltas:  28% (32/114)   Resolving deltas:  30% (35/114)   Resolving deltas:  31% (36/114)   Resolving deltas:  32% (37/114)   Resolving deltas:  33% (38/114)   Resolving deltas:  34% (39/114)   Resolving deltas:  35% (40/114)   Resolving deltas:  36% (42/114)   Resolving deltas:  38% (44/114)   Resolving deltas:  40% (46/114)   Resolving deltas:  42% (49/114)   Resolving deltas:  44% (51/114)   Resolving deltas:  46% (53/114)   Resolving deltas:  47% (54/114)   Resolving deltas:  48% (55/114)   Resolving deltas:  49% (56/114)   Resolving deltas:  50% (57/114)   Resolving deltas:  57% (65/114)   Resolving deltas:  58% (67/114)   Resolving deltas:  64% (73/114)   Resolving deltas:  65% (75/114)   Resolving deltas:  66% (76/114)   Resolving deltas:  67% (77/114)   Resolving deltas:  68% (78/114)   Resolving deltas:  72% (83/114)   Resolving deltas:  75% (86/114)   Resolving deltas:  78% (90/114)   Resolving deltas:  81% (93/114)   Resolving deltas:  83% (95/114)   Resolving deltas:  84% (96/114)   Resolving deltas:  85% (97/114)   Resolving deltas:  86% (99/114)   Resolving deltas:  87% (100/114)   Resolving deltas:  88% (101/114)   Resolving deltas:  89% (102/114)   Resolving deltas:  90% (103/114)   Resolving deltas:  91% (104/114)   Resolving deltas:  92% (105/114)   Resolving deltas:  97% (111/114)   Resolving deltas:  98% (112/114)   Resolving deltas: 100% (114/114)   Resolving deltas: 100% (114/114), completed with 44 local objects.
From ssh://remote.cs.binghamton.edu/~umrigar/git-repos/cs220
   9868958..9670665  master     -> origin/master
Updating 9868958..9670665
Fast-forward
 announce.html                                            |    2 [32m+[m[31m-[m
 assets/umt/article-template.html                         |    2 [32m+[m[31m-[m
 assets/umt/slides-template.html                          |    2 [32m+[m[31m-[m
 docs/index.html                                          |    2 [32m+[m[31m-[m
 ex/index.umt                                             |    2 [31m-[m
 exams-quizzes/index.html                                 |    2 [32m+[m[31m-[m
 {ex => exercises}/Makefile                               |    0
 exercises/config.json                                    |    4 [32m+[m
 exercises/exercises.umt                                  |    0
 {ex => exercises}/index.html                             |    6 [32m+[m[31m-[m
 exercises/index.umt                                      |    4 [32m+[m
 exercises/questions/index.js                             |    3 [32m+[m
 exercises/questions/package-lock.json                    |   13 [32m+[m
 exercises/questions/package.json                         |   18 [32m+[m
 exercises/questions/src/meta.js                          |   19 [32m+[m
 exercises/questions/src/programming/arith.js             |  121 [32m++++[m
 exercises/questions/src/programming/bit-util.js          |   28 [32m+[m
 exercises/questions/src/programming/bitwise-operators.js |   70 [32m++[m
 exercises/questions/src/programming/from-signed.js       |  103 [32m+++[m
 exercises/questions/src/programming/from-unsigned.js     |   83 [32m+++[m
 exercises/questions/src/programming/meta.js              |   18 [32m+[m
 exercises/questions/src/programming/oct-dec-hex.js       |  128 [32m++++[m
 exercises/questions/src/programming/signed-overflow.js   |  103 [32m+++[m
 exercises/questions/src/programming/string-array-size.js |  100 [32m+++[m
 exercises/questions/src/programming/to-signed.js         |  103 [32m+++[m
 exercises/questions/src/programming/to-unsigned.js       |   82 [32m+++[m
 exercises/questions/src/programming/unsigned-overflow.js |   96 [32m+++[m
 exercises/templates/index.html                           |   40 [32m++[m
 hws/index.html                                           |    2 [32m+[m[31m-[m
 index.html                                               |   33 [32m+[m[31m-[m
 index.umt                                                |    9 [32m+[m
 labs/index.html                                          |   27 [32m+[m[31m-[m
 labs/index.umt                                           |    3 [32m+[m[31m-[m
 labs/lab1/lab1.html                                      |  148 [32m++[m[31m--[m
 labs/lab1/lab1.pdf                                       |  Bin [31m89136[m -> [32m89136[m bytes
 labs/lab2/lab2.html                                      |    2 [32m+[m[31m-[m
 labs/lab2/lab2.pdf                                       |  Bin [31m102661[m -> [32m102661[m bytes
 labs/lab3/Makefile                                       |   22 [32m+[m
 labs/lab3/files/.gitignore                               |    1 [32m+[m
 labs/lab3/files/Makefile                                 |    2 [32m+[m
 labs/lab3/files/ex1/.gitignore                           |    1 [32m+[m
 labs/lab3/files/ex1/Makefile                             |    3 [32m+[m
 labs/lab3/files/ex1/README                               |    1 [32m+[m
 labs/lab3/files/ex1/hello.c                              |   23 [32m+[m
 labs/lab3/files/ex2/Makefile                             |    3 [32m+[m
 labs/lab3/files/ex2/README                               |    4 [32m+[m
 labs/lab3/files/ex2/hello.c                              |   48 [32m++[m
 labs/lab3/lab3.html                                      |  215 [32m++++++[m
 labs/lab3/lab3.pdf                                       |  Bin [31m0[m -> [32m92709[m bytes
 labs/lab3/lab3.umt                                       |  297 [32m++++++++[m
 labs/lab3/term.gif                                       |  Bin [31m0[m -> [32m11238[m bytes
 labs/lab3/term.png                                       |  Bin [31m0[m -> [32m8053[m bytes
 misc/index.html                                          |    2 [32m+[m[31m-[m
 projects/index.html                                      |    2 [32m+[m[31m-[m
 projects/prj1/aux-files/test1.LOG                        |    2 [32m+[m[31m-[m
 projects/prj1/prj1-sol/bits-to-ints.c                    |    1 [32m+[m
 projects/prj1/prj1-sol/main.c                            |   12 [32m+[m[31m-[m
 projects/prj1/prj1.html                                  |   32 [32m+[m[31m-[m
 projects/prj1/prj1.pdf                                   |  Bin [31m88917[m -> [32m89276[m bytes
 projects/prj1/prj1.umt                                   |    7 [32m+[m[31m-[m
 slides/c-intro/c-intro.html                              |  487 [32m++++++++++++[m[31m-[m
 slides/c-intro/c-intro.pdf                               |  Bin [31m181922[m -> [32m286549[m bytes
 slides/c-intro/c-intro.umt                               | 1035 [32m++++++++++++++[m[31m--------------[m
 slides/c-intro/code/count-1s-1.c                         |    9 [32m+[m[31m-[m
 slides/c-intro/code/count-1s-2.c                         |    9 [32m+[m[31m-[m
 slides/c-intro/code/endian.c                             |    7 [32m+[m[31m-[m
 slides/c-intro/code/integer-sizes.c                      |   12 [32m+[m[31m-[m
 slides/c-intro/code/kilo-powers.c                        |   15 [32m+[m[31m-[m
 slides/index.html                                        |    2 [32m+[m[31m-[m
 slides/intro/intro.html                                  |    2 [32m+[m[31m-[m
 slides/intro/intro.pdf                                   |  Bin [31m350820[m -> [32m350820[m bytes
 slides/syllabus/syllabus.html                            |    2 [32m+[m[31m-[m
 slides/syllabus/syllabus.pdf                             |  Bin [31m114341[m -> [32m114341[m bytes
 73 files changed, 2946 insertions(+), 690 deletions(-)
 delete mode 100644 ex/index.umt
 rename {ex => exercises}/Makefile (100%)
 create mode 100644 exercises/config.json
 create mode 100644 exercises/exercises.umt
 rename {ex => exercises}/index.html (76%)
 create mode 100644 exercises/index.umt
 create mode 100644 exercises/questions/index.js
 create mode 100644 exercises/questions/package-lock.json
 create mode 100644 exercises/questions/package.json
 create mode 100644 exercises/questions/src/meta.js
 create mode 100644 exercises/questions/src/programming/arith.js
 create mode 100644 exercises/questions/src/programming/bit-util.js
 create mode 100644 exercises/questions/src/programming/bitwise-operators.js
 create mode 100644 exercises/questions/src/programming/from-signed.js
 create mode 100644 exercises/questions/src/programming/from-unsigned.js
 create mode 100644 exercises/questions/src/programming/meta.js
 create mode 100644 exercises/questions/src/programming/oct-dec-hex.js
 create mode 100644 exercises/questions/src/programming/signed-overflow.js
 create mode 100644 exercises/questions/src/programming/string-array-size.js
 create mode 100644 exercises/questions/src/programming/to-signed.js
 create mode 100644 exercises/questions/src/programming/to-unsigned.js
 create mode 100644 exercises/questions/src/programming/unsigned-overflow.js
 create mode 100644 exercises/templates/index.html
 create mode 100755 labs/lab3/Makefile
 create mode 100644 labs/lab3/files/.gitignore
 create mode 100644 labs/lab3/files/Makefile
 create mode 100644 labs/lab3/files/ex1/.gitignore
 create mode 100644 labs/lab3/files/ex1/Makefile
 create mode 100644 labs/lab3/files/ex1/README
 create mode 100644 labs/lab3/files/ex1/hello.c
 create mode 100644 labs/lab3/files/ex2/Makefile
 create mode 100644 labs/lab3/files/ex2/README
 create mode 100644 labs/lab3/files/ex2/hello.c
 create mode 100644 labs/lab3/lab3.html
 create mode 100644 labs/lab3/lab3.pdf
 create mode 100644 labs/lab3/lab3.umt
 create mode 100644 labs/lab3/term.gif
 create mode 100644 labs/lab3/term.png
rimai1@g7-33:~/git-repos/cs220/labs$ ls
index.html  index.umt  lab1  lab2  lab3  lab-tips  Makefile
rimai1@g7-33:~/git-repos/cs220/labs$ w[Kpo[K[Kls[K[Kls[K[Kcd lab3
rimai1@g7-33:~/git-repos/cs220/labs/lab3$ ls
files  lab3.html  lab3.pdf  lab3.umt  Makefile	term.gif  term.png
rimai1@g7-33:~/git-repos/cs220/labs/lab3$ cd ~
rimai1@g7-33:~$ ls
a.out		 BillGates.asm	cs220	   git-repos	   ls.log	  Public       v1.s
Arduino		 bin-c.log	Desktop    HelloWorld	   manyHello.asm  T1.s	       v.c
array.asm	 cat.lo		dir	   HelloWorld.asm  mipsAsm.asm	  Templates    Videos
assembler-lab	 cat.log	Documents  i220b	   Music	  tinyproc2.s  x.c
assembler-lab.c  cs120		Downloads  lab2		   Pictures	  tl.c
rimai1@g7-33:~$ cd git-repos/c[Ki220c[Kb
rimai1@g7-33:~/git-repos/i220b$ ls
README.md  submit  work
rimai1@g7-33:~/git-repos/i220b$ su[K[Kro[K[Kcd wr[Kork
rimai1@g7-33:~/git-repos/i220b/work$ ls
lab3
rimai1@g7-33:~/git-repos/i220b/work$ cd[K[Kcd lab3
rimai1@g7-33:~/git-repos/i220b/work/lab3$  [Kcp -r ~/git-repos/cs220/labs/lab3/files/*'[K.[K. .
rimai1@g7-33:~/git-repos/i220b/work/lab3$ ls
ex1  ex2  lab3.log  Makefile
rimai1@g7-33:~/git-repos/i220b/work/lab3$ e[Kcd ex1
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ ls
hello.c  Makefile  README
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ n[Kls 0[K-l
total 12
-rw-r--r-- 1 rimai1 rimai1 343 Sep  5 15:14 hello.c
-rw-r--r-- 1 rimai1 rimai1  35 Sep  5 15:14 Makefile
-rw-r--r-- 1 rimai1 rimai1  61 Sep  5 15:14 README
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ f[Kgedit README
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ clear
[H[2J[3Jrimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ ;s
bash: syntax error near unexpected token `;'
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ ls
hello.c  Makefile  README
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ gedit Makefile
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ make
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ gedit a[KMakefile
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ /[K./ [Khello
usage: ./hello NAME...
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ ./hello barrt[K[Kt lisa
hello bart
hello lisa
hello (null)
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ gbf[Kd helllo[K[Ko
bash: gbd: command not found
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ bdg[K[K[Kgdb hello
GNU gdb (Debian 8.2.1-2) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) e[Kstart bart lisa
Temporary breakpoint 1 at 0x118b: file hello.c, line 13.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe788) at hello.c:13
13	  if (argc == 1) {
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
15	    exit(1);
16	  }
17	  else {
(gdb) 
18	    for (int i = 1; i <= argc; i++) {
19	      say_hello(argv[i]);
20	    }
21	  }
22	  return 0;
23	}
(gdb) b say_ha[Kello
Breakpoint 2 at 0x555555555161: file hello.c, line 7.
(gdb) o[Kp argc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffe788
(gdb) p argv[0]
$3 = 0x7fffffffea75 "/import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello"
(gdb) p argv[1]
$4 = 0x7fffffffeab4 "bart"
(gdb) p argv[1][K[K2]
$5 = 0x7fffffffeab9 "lisa"
(gdb) p argv[2][K[K4[K3]
$6 = 0x0
(gdb) p argv[3][K[K4]
$7 = 0x7fffffffeabe "SHELL=/bin/bash"
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      say_hello(argv[i]);
(gdb) p i
$8 = 1
(gdb) a c.say_hello[K[K[K[K[K[K[K[K[K[K[K[K[Kc
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) l
2	#include <stdlib.h>
3	
4	static void
5	say_hello(const char *name)
6	{
7	  printf("hello %s\n", name);
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) backtrace
#0  say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe788) at hello.c:19
(gdb) p argc
No symbol "argc" in current context.
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe788) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p argc[Kv
$9 = (const char **) 0x7fffffffe788
(gdb) p i
$10 = 1
(gdb) p argv
$11 = (const char **) 0x7fffffffe788
(gdb) pargc
Undefined command: "pargc".  Try "help".
(gdb) pargc[K[K[K[K argc
$12 = 3
(gdb) down
#0  say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p nae[Kme
$13 = 0x7fffffffeab4 "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 2, say_hello (name=0x7fffffffeab9 "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello lisa

Breakpoint 2, say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello (null)
[Inferior 1 (process 30831) exited normally]
(gdb) up
No stack.
(gdb) p i
No symbol "i" in current context.
(gdb) p[Kup
No stack.
(gdb) start
Temporary breakpoint 3 at 0x55555555518b: file hello.c, line 13.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello bart lisa

Temporary breakpoint 3, main (argc=3, argv=0x7fffffffe788) at hello.c:13
13	  if (argc == 1) {
(gdb) stat[Krt hgj kugh 
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Temporary breakpoint 4 at 0x55555555518b: file hello.c, line 13.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello hgj kugh

Temporary breakpoint 4, main (argc=3, argv=0x7fffffffe788) at hello.c:13
13	  if (argc == 1) {
(gdb) a[Kpp[K[Kstartt[K li[K[Kbart lsa[K[Kisa
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Temporary breakpoint 5 at 0x55555555518b: file hello.c, line 13.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello bart lisa

Temporary breakpoint 5, main (argc=3, argv=0x7fffffffe788) at hello.c:13
13	  if (argc == 1) {
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) n[Kp name
$14 = 0x7fffffffeab4 "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 2, say_hello (name=0x7fffffffeab9 "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello lisa

Breakpoint 2, say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello (null)
[Inferior 1 (process 714) exited normally]
(gdb) up
No stack.
(gdb) p i
No symbol "i" in current context.
(gdb)  [Kstar [Kt lisa[K[K[K[K[K bart lisa
Temporary breakpoint 6 at 0x55555555518b: file hello.c, line 13.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello bart lisa

Temporary breakpoint 6, main (argc=3, argv=0x7fffffffe788) at hello.c:13
13	  if (argc == 1) {
(gdb) d[Kup
Initial frame selected; you cannot go up.
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe788) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p i
$15 = 1
(gdb) ;[Kp argc
$16 = 3
(gdb) c
Continuing.
hello bart

Breakpoint 2, say_hello (name=0x7fffffffeab9 "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello lisa

Breakpoint 2, say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello (null)
[Inferior 1 (process 974) exited normally]
(gdb) p i
No symbol "i" in current context.
(gdb) up
No stack.
(gdb) down
No stack.
(gdb) start n[Kbart lisa
Temporary breakpoint 7 at 0x55555555518b: file hello.c, line 13.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello bart lisa

Temporary breakpoint 7, main (argc=3, argv=0x7fffffffe788) at hello.c:13
13	  if (argc == 1) {
(gdb) d[Kc
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb)  [Kc
Continuing.
hello bart

Breakpoint 2, say_hello (name=0x7fffffffeab9 "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello lisa

Breakpoint 2, say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello (null)
[Inferior 1 (process 1499) exited normally]
(gdb) up
No stack.
(gdb) q
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ gdb hello
GNU gdb (Debian 8.2.1-2) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x118b: file hello.c, line 13.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe788) at hello.c:13
13	  if (argc == 1) {
(gdb) c [K[Kb sat[Ky_hello h[K[K
Breakpoint 2 at 0x555555555161: file hello.c, line 7.
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      say_hello(argv[i]);
(gdb) l
14	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
15	    exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      say_hello(argv[i]);
20	    }
21	  }
22	  return 0;
23	}
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) backtrace
#0  say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe788) at hello.c:19
(gdb) n
hello bart
8	}
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex1/hello bart lisa

Breakpoint 2, say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) backtrace 
#0  say_hello (name=0x7fffffffeab4 "bart") at hello.c:7
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe788) at hello.c:19
(gdb) l
2	#include <stdlib.h>
3	
4	static void
5	say_hello(const char *name)
6	{
7	  printf("hello %s\n", name);
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) p[Kn
hello bart
8	}
(gdb) p name
$1 = 0x7fffffffeab4 "bart"
(gdb) n
main (argc=3, argv=0x7fffffffe788) at hello.c:18
18	    for (int i = 1; i <= argc; i++) {
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeab9 "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) l
2	#include <stdlib.h>
3	
4	static void
5	say_hello(const char *name)
6	{
7	  printf("hello %s\n", name);
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe788) at hello.c:19
19	      say_hello(argv[i]);
(gdb) b[Kdown
#0  say_hello (name=0x7fffffffeab9 "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) na[K[Kp name
$2 = 0x7fffffffeab9 "lisa"
(gdb) n
hello lisa
8	}
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb)  [Kp name
$3 = 0x0
(gdb) uop[K[Kp
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe788) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p i
$4 = 3
(gdb)  ar[K[K[Kp argc
$5 = 3
(gdb)  [Kq
A debugging session is active.

	Inferior 1 [process 1955] will be killed.

Quit anyway? (y or n) y
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ ls
hello  hello.c	Makefile  README
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ e[Kgedit hello.c&[K &
[1] 2610
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ 
(gedit:2610): Gtk-[1;33mWARNING[0m **: [34m15:46:39.635[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist


[1]+  Done                    gedit hello.c
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ ./c[Khe[K[K[K[Kc[Kcmpi[K[K[K[Kccc[K[K[Kdcc[K[K[Kcd [K[K[Kdc[K[Kger[K[K[Kgedit hello.c &
[1] 2788
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ df[K[K
[1]+  Done                    gedit hello.c
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ po[K[K;s[K[K./hello
usage: ./hello NAME...
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ ./hello bart lisa
hello bart
hello lisa
hello (null)
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ mka[Kake[K[K[K[K[Kmake
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ make./hello bart lisa
hello bart
hello lisa
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex1$ cd ..
rimai1@g7-33:~/git-repos/i220b/work/lab3$ cd ex2
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ls
hello.c  Makefile  README
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make[K[K[K[K./hello
bash: ./hello: No such file or directory
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./hello
usage: ./hello NAME...
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./hello lisa bart
Hello Lisa
Hello Bart
Segmentation fault
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./hello lisa bart[1@'[1P[C[1@ [1@'[C[1P[C[C[C[C[C[C[C[C't[1Pt[C'
Hello Lisa Bartcv~DV
Segmentation fault
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ gfb[K[Kdb hello
GNU gdb (Debian 8.2.1-2) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) l
21	    }
22	    inWord = isalpha(in[i]);
23	  }
24	}
25	
26	static void
27	say_hello(const char *name)
28	{
29	  printf("Hello %s\n", name);
30	}
(gdb) 
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
40	    for (int i = 1; i <= argc; i++) {
(gdb) 
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
48	}
(gdb) start luisa[K[K[K[K[Kbart lisa
Temporary breakpoint 1 at 0x12be: file hello.c, line 35.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe788) at hello.c:35
35	  if (argc == 1) {
(gdb) p arh[Kgc
$1 = 3
(gdb) ls
Undefined command: "ls".  Try "help".
(gdb) l
30	}
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
(gdb) 
40	    for (int i = 1; i <= argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
48	}
(gdb) backtrace
#0  main (argc=3, argv=0x7fffffffe788) at hello.c:35
(gdb) ls[K
Line number 49 out of range; hello.c has 48 lines.
(gdb) up
Initial frame selected; you cannot go up.
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) backtrace
#0  main (argc=3, argv=0x7fffffffe788) at hello.c:35
(gdb) 
#0  main (argc=3, argv=0x7fffffffe788) at hello.c:35
(gdb) n
40	    for (int i = 1; i <= argc; i++) {
(gdb) n
41	      const char *name = argv[i];
(gdb) l
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
40	    for (int i = 1; i <= argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello bart lisa
Hello Bart
Hello Lisa

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) 
(gdb) l
115	in ../sysdeps/x86_64/multiarch/../strlen.S
(gdb) \[Ks[Kb star[K[K[K[Ksay [K_hello 
Breakpoint 2 at 0x55555555528b: file hello.c, line 29.
(gdb) l
115	in ../sysdeps/x86_64/multiarch/../strlen.S
(gdb) 
115	in ../sysdeps/x86_64/multiarch/../strlen.S
(gdb) n

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) start bart lisa
Temporary breakpoint 3 at 0x5555555552be: file hello.c, line 35.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello bart lisa

Temporary breakpoint 3, main (argc=3, argv=0x7fffffffe788) at hello.c:35
35	  if (argc == 1) {
(gdb) l
30	}
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
(gdb) up
Initial frame selected; you cannot go up.
(gdb) b [K[Kbackta[Krace
#0  main (argc=3, argv=0x7fffffffe788) at hello.c:35
(gdb) df[K[Kb[Kb say [K_hello 
Note: breakpoint 2 also set at pc 0x55555555528b.
Breakpoint 4 at 0x55555555528b: file hello.c, line 29.
(gdb) up
Initial frame selected; you cannot go up.
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) l
40	    for (int i = 1; i <= argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
48	}
(gdb) vb[K[Kbacktrace
#0  main (argc=3, argv=0x7fffffffe788) at hello.c:35
(gdb) b say_hello 
Note: breakpoints 2 and 4 also set at pc 0x55555555528b.
Breakpoint 5 at 0x55555555528b: file hello.c, line 29.
(gdb) l
Line number 49 out of range; hello.c has 48 lines.
(gdb) n
40	    for (int i = 1; i <= argc; i++) {
(gdb) n[K;
Undefined command: "".  Try "help".
(gdb) l
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
40	    for (int i = 1; i <= argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
(gdb) 
45	    }
46	  }
47	  return 0;
48	}
(gdb) 
Line number 49 out of range; hello.c has 48 lines.
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) up
Initial frame selected; you cannot go up.
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffe630 "Bart") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) c
Continuing.
Hello Bart

Breakpoint 2, say_hello (name=0x7fffffffe630 "Lisa") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) po[K[Kclear
Deleted breakpoints 2 4 5 
(gdb) s[Kq
A debugging session is active.

	Inferior 1 [process 4313] will be killed.

Quit anyway? (y or n) y
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ clear
[H[2J[3Jrimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ls
hello  hello.c	Makefile  README
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ db[K[Kgbd[K[Kdb [K[K[K[Kbg[Kdg[K[K[Kd[Kdb[K[Kg[Kbdg[K[K[Kgdb hello
GNU gdb (Debian 8.2.1-2) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start l[K[K bart lisa
Temporary breakpoint 1 at 0x12be: file hello.c, line 35.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe788) at hello.c:35
35	  if (argc == 1) {
(gdb) l
30	}
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
(gdb) 
40	    for (int i = 1; i <= argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
48	}
(gdb) s[Kb say_hello 
Breakpoint 2 at 0x55555555528b: file hello.c, line 29.
(gdb) p argc
$1 = 3
(gdb) a[Kp argv
$2 = (const char **) 0x7fffffffe788
(gdb) p argv[0]
$3 = 0x7fffffffea75 "/import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello"
(gdb) p argv[0][K[K1]
$4 = 0x7fffffffeab4 "bart"
(gdb) p argv[1]21][C[1P1][C[1P]2]
$5 = 0x7fffffffeab9 "lisa"
(gdb) p argv[2][C[1P]3]
$6 = 0x0
(gdb) n
40	    for (int i = 1; i <= argc; i++) {
(gdb) l
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
40	    for (int i = 1; i <= argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
(gdb) n
41	      const char *name = argv[i];
(gdb) pi[K i
$7 = 1
(gdb) i[Ki[Kp name
$8 = 0x0
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffe630 "Bart") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) p nam
No symbol "nam" in current context.
(gdb) pnam[K[K[K name
$9 = 0x7fffffffe630 "Bart"
(gdb) bak[Kckt[Ktrace say_hello [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kbackttr[K[Krace
#0  say_hello (name=0x7fffffffe630 "Bart") at hello.c:29
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe788) at hello.c:44
(gdb) p argv
No symbol "argv" in current context.
(gdb) pa[K argc
No symbol "argc" in current context.
(gdb) p i
No symbol "i" in current context.
(gdb) p name
$10 = 0x7fffffffe630 "Bart"
(gdb) up
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe788) at hello.c:44
44	      say_hello(friendlyName);
(gdb)  [Kdown
#0  say_hello (name=0x7fffffffe630 "Bart") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) c
Continuing.
Hello Bart

Breakpoint 2, say_hello (name=0x7fffffffe630 "Lisa") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) n ma[K[K[K[Kp name
$11 = 0x7fffffffe630 "Lisa"
(gdb) n
Hello Lisa
30	}
(gdb) n[Kp[Kc
Continuing.

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) ba[K[Kd[Kup
#1  0x0000555555555329 in main (argc=3, argv=0x7fffffffe788) at hello.c:42
42	      char friendlyName[strlen(name)];
(gdb) down
#0  __strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) c
Continuing.

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) up
No stack.
(gdb) down
No stack.
(gdb) st[K[Kr
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello bart lisa

Breakpoint 2, say_hello (name=0x7fffffffe630 "Bart") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) n
Hello Bart
30	}
(gdb) n
main (argc=3, argv=0x7fffffffe788) at hello.c:40
40	    for (int i = 1; i <= argc; i++) {
(gdb) n
41	      const char *name = argv[i];
(gdb) 
42	      char friendlyName[strlen(name)];
(gdb) 
43	      upcase_words(name, friendlyName);
(gdb) 
44	      say_hello(friendlyName);
(gdb) 

Breakpoint 2, say_hello (name=0x7fffffffe630 "Lisa") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) n[Kb[Kbacktracve[K[Ke
#0  say_hello (name=0x7fffffffe630 "Lisa") at hello.c:29
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe788) at hello.c:44
(gdb) 
#0  say_hello (name=0x7fffffffe630 "Lisa") at hello.c:29
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe788) at hello.c:44
(gdb) n
Hello Lisa
30	}
(gdb) up
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe788) at hello.c:44
44	      say_hello(friendlyName);
(gdb) l
39	  else {
40	    for (int i = 1; i <= argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
48	}
(gdb) b [K [K say_hello 
Note: breakpoint 2 also set at pc 0x55555555528b.
Breakpoint 3 at 0x55555555528b: file hello.c, line 29.
(gdb) n
main (argc=3, argv=0x7fffffffe788) at hello.c:40
40	    for (int i = 1; i <= argc; i++) {
(gdb) 
41	      const char *name = argv[i];
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) up
Initial frame selected; you cannot go up.
(gdb) 
Initial frame selected; you cannot go up.
(gdb) n
42	      char friendlyName[strlen(name)];
(gdb) l
37	    exit(1);
38	  }
39	  else {
40	    for (int i = 1; i <= argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
(gdb) 
47	  return 0;
48	}
(gdb) n

Program received signal SIGSEGV, Segmentation fault.
__strlen_sse2 () at ../sysdeps/x86_64/multiarch/../strlen.S:120
120	../sysdeps/x86_64/multiarch/../strlen.S: No such file or directory.
(gdb) bn[K upcase_words \[K
Breakpoint 4 at 0x555555555195: file hello.c, line 13.
(gdb) l
115	in ../sysdeps/x86_64/multiarch/../strlen.S
(gdb) c
Continuing.

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) r
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello bart lisa

Breakpoint 4, upcase_words (in=0x7fffffffeab4 "bart", out=0x7fffffffe630 "\001")
    at hello.c:13
13	  int inWord = 0;
(gdb) l
8	 *  has enough space for the strlen(in) characters of in.
9	 */
10	void
11	upcase_words(const char in[], char out[])
12	{
13	  int inWord = 0;
14	  int n = strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && isalpha(in[i])) {
17	      out[i] = toupper(in[i]);
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffe630 "Bart") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) pna[K[K name
$12 = 0x7fffffffe630 "Bart"
(gdb) b word[K[K[K[Kupcva[K[Kase_words 
Note: breakpoint 4 also set at pc 0x555555555195.
Breakpoint 5 at 0x555555555195: file hello.c, line 13.
(gdb) up
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe788) at hello.c:44
44	      say_hello(friendlyName);
(gdb) doow[K[Kwn
#0  say_hello (name=0x7fffffffe630 "Bart") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) down[2Pupb upcase_words [C[C[C[C[C[C[9Pp nameb upcase_words 
Note: breakpoints 4 and 5 also set at pc 0x555555555195.
Breakpoint 6 at 0x555555555195: file hello.c, line 13.
(gdb) l
24	}
25	
26	static void
27	say_hello(const char *name)
28	{
29	  printf("Hello %s\n", name);
30	}
31	
32	int
33	main(int argc, const char *argv[])
(gdb) n
Hello Bart
30	}
(gdb) n
main (argc=3, argv=0x7fffffffe788) at hello.c:40
40	    for (int i = 1; i <= argc; i++) {
(gdb) n
41	      const char *name = argv[i];
(gdb) 
42	      char friendlyName[strlen(name)];
(gdb) 
43	      upcase_words(name, friendlyName);
(gdb) 

Breakpoint 4, upcase_words (in=0x7fffffffeab9 "lisa", out=0x7fffffffe630 "Bart")
    at hello.c:13
13	  int inWord = 0;
(gdb) l
8	 *  has enough space for the strlen(in) characters of in.
9	 */
10	void
11	upcase_words(const char in[], char out[])
12	{
13	  int inWord = 0;
14	  int n = strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && isalpha(in[i])) {
17	      out[i] = toupper(in[i]);
(gdb) b is
is_dir                     isinfl                     iswalnum_l
is_dir.isra                islower                    iswalpha
is_dir.isra.2              islower_l                  iswalpha_l
is_dst                     isnan                      iswblank
is_trusted_path_normalize  isnanf                     iswblank_l
isalnum                    isnanf128_do_not_use       iswcntrl
isalnum_l                  isnanl                     iswcntrl_l
isalpha                    isoc99_fscanf.c            iswctype
isalpha_l                  isoc99_fwscanf.c           iswctype.c
isascii                    isoc99_scanf.c             iswctype_l
isastream                  isoc99_sscanf.c            iswctype_l.c
isastream.c                isoc99_swscanf.c           iswdigit
isatty                     isoc99_vfscanf.c           iswdigit_l
isatty.c                   isoc99_vfwscanf.c          iswgraph
isblank                    isoc99_vscanf.c            iswgraph_l
isblank_l                  isoc99_vsscanf.c           iswlower
iscntrl                    isoc99_vswscanf.c          iswlower_l
iscntrl_l                  isoc99_vwscanf.c           iswprint
isctype                    isoc99_wscanf.c            iswprint_l
isctype.c                  isprint                    iswpunct
isdigit                    isprint_l                  iswpunct_l
isdigit_l                  ispunct                    iswspace
--More--[K(gdb) b is[K[K[K[Kb iaa[K[Ksal[Klpha
Breakpoint 7 at 0x7ffff7e061b0: file ../include/ctype.h, line 41.
(gdb) l
18	    }
19	    else {
20	      out[i] = in[i];
21	    }
22	    inWord = isalpha(in[i]);
23	  }
24	}
25	
26	static void
27	say_hello(const char *name)
(gdb) 
28	{
29	  printf("Hello %s\n", name);
30	}
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
(gdb) n
14	  int n = strlen(in);
(gdb) l
9	 */
10	void
11	upcase_words(const char in[], char out[])
12	{
13	  int inWord = 0;
14	  int n = strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && isalpha(in[i])) {
17	      out[i] = toupper(in[i]);
18	    }
(gdb) ls[K[Kq
A debugging session is active.

	Inferior 1 [process 7113] will be killed.

Quit anyway? (y or n) y
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ u[Ki[Kls
hello  hello.c	Makefile  README
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ gedit hello.c &
[1] 7626
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ 
(gedit:7626): Gtk-[1;33mWARNING[0m **: [34m16:22:58.526[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist


rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ 
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make
cc -g -Wall -std=c99    hello.c   -o hello
[01m[Khello.c:[m[K In function ‘[01m[Ksay_hello[m[K’:
[01m[Khello.c:29:18:[m[K [01;35m[Kwarning: [m[Kformat ‘[01m[K%s[m[K’ expects argument of type ‘[01m[Kchar *[m[K’, but argument 2 has type ‘[01m[Kint[m[K’ [[01;35m[K-Wformat=[m[K]
   printf("Hello [01;35m[K%s[m[K\n", [32m[K*name[m[K);
                 [01;35m[K~^[m[K     [32m[K~~~~~[m[K
                 [32m[K%d[m[K
[1]+  Done                    gedit hello.c
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ g[Kgedit hello.c &
[1] 9058
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ 
(gedit:9058): Gtk-[1;33mWARNING[0m **: [34m16:31:07.729[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist


rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ gedit hello.c &make[K
cc -g -Wall -std=c99    hello.c   -o hello
[01m[Khello.c:[m[K In function ‘[01m[Ksay_hello[m[K’:
[01m[Khello.c:29:18:[m[K [01;35m[Kwarning: [m[Kformat ‘[01m[K%s[m[K’ expects argument of type ‘[01m[Kchar *[m[K’, but argument 2 has type ‘[01m[Kint[m[K’ [[01;35m[K-Wformat=[m[K]
   printf("Hello [01;35m[K%s[m[K\n", [32m[Kname[m[K);
                 [01;35m[K~^[m[K     [32m[K~~~~[m[K
                 [32m[K%d[m[K
[01m[Khello.c:[m[K In function ‘[01m[Kmain[m[K’:
[01m[Khello.c:44:17:[m[K [01;35m[Kwarning: [m[Kpassing argument 1 of ‘[01m[Ksay_hello[m[K’ makes integer from pointer without a cast [[01;35m[K-Wint-conversion[m[K]
       say_hello([01;35m[KfriendlyName[m[K);
                 [01;35m[K^~~~~~~~~~~~[m[K
[01m[Khello.c:27:22:[m[K [01;36m[Knote: [m[Kexpected ‘[01m[Kchar[m[K’ but argument is of type ‘[01m[Kchar *[m[K’
 say_hello([01;36m[Kconst char name[m[K)
           [01;36m[K~~~~~~~~~~~^~~~[m[K
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ makegedit hello.c &make[K
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./ [Khello bart lisaa
Hello Bart
Hello Lisaa
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ bart [K[K[K[K[K''b'a'r't' 's'i'm'p's'o'n'[C ''l'i's'a' 's'i'm'p's'o'n'
bash: bart simpson: command not found
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ 'bart simpson' 'lisa simpson'[1@.[1@/[1@h[1@e[1@l[1@l[1@o[1@ 
Hello Bart SimpsonU
Hello Lisa SimpsonU
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ d[Kb[Kgdb hello
GNU gdb (Debian 8.2.1-2) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bar [K[K[K[K''b'a'r't' 's'i'm'p's'o'n's'[1P'[C
Temporary breakpoint 1 at 0x12be: file hello.c, line 35.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello 'bart simpson'

Temporary breakpoint 1, main (argc=2, argv=0x7fffffffe798) at hello.c:35
35	  if (argc == 1) {
(gdb) n
40	    for (int i = 1; i < argc; i++) {
(gdb) l
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
40	    for (int i = 1; i < argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
(gdb) n
41	      const char *name = argv[i];
(gdb) n
42	      char friendlyName[strlen(name)];
(gdb) n
43	      upcase_words(name, friendlyName);
(gdb) n
44	      say_hello(friendlyName);
(gdb) 
Hello Bart SimpsonUU
40	    for (int i = 1; i < argc; i++) {
(gdb) b sayH[Khell[K[K[K[K_hello 
Breakpoint 2 at 0x55555555528b: file hello.c, line 29.
(gdb) l
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
40	    for (int i = 1; i < argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
(gdb) n
47	  return 0;
(gdb) l
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
48	}
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello 'bart simpson'

Breakpoint 2, say_hello (name=0x7fffffffe640 "Bart SimpsonUU") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) n
Hello Bart SimpsonUU
30	}
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello 'bart simpson'

Breakpoint 2, say_hello (name=0x7fffffffe640 "Bart SimpsonUU") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) k[Kl[Kr 
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello 'bart simpson'

Breakpoint 2, say_hello (name=0x7fffffffe640 "Bart SimpsonUU") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) up
#1  0x0000555555555390 in main (argc=2, argv=0x7fffffffe798) at hello.c:44
44	      say_hello(friendlyName);
(gdb) p frine[K[KendlyName
$1 = "Bart Simpson"
(gdb) down
#0  say_hello (name=0x7fffffffe640 "Bart SimpsonUU") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) n[Kp nam
No symbol "nam" in current context.
(gdb) p name
$2 = 0x7fffffffe640 "Bart SimpsonUU"
(gdb) q
A debugging session is active.

	Inferior 1 [process 10239] will be killed.

Quit anyway? (y or n) y
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ gdb hello./hello 'bart simpson' 'lisa simpson'[8P[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[11P./hello bart lisaamake[K
cc -g -Wall -std=c99    hello.c   -o hello
[01m[Khello.c:[m[K In function ‘[01m[Kmain[m[K’:
[01m[Khello.c:43:26:[m[K [01;35m[Kwarning: [m[Kpassing argument 2 of ‘[01m[Kupcase_words[m[K’ discards ‘[01m[Kconst[m[K’ qualifier from pointer target type [[01;35m[K-Wdiscarded-qualifiers[m[K]
       upcase_words(name, [01;35m[KfriendlyName[m[K);
                          [01;35m[K^~~~~~~~~~~~[m[K
[01m[Khello.c:11:36:[m[K [01;36m[Knote: [m[Kexpected ‘[01m[Kchar *[m[K’ but argument is of type ‘[01m[Kconst char *[m[K’
 upcase_words(const char in[], [01;36m[Kchar out[][m[K)
                               [01;36m[K~~~~~^~~~~[m[K
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ makegdb hello[5Pmake
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ makegdb hello./hello 'bart simpson' 'lisa simpson'[8P[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[8@./hello [C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Bart SimpsonU
Hello Lisa SimpsonU
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ gdb [K[Kb po[K[K[K hello
GNU gdb (Debian 8.2.1-2) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start ""[K[K''b'a'r't' 's'i'm'p's'o'n'
Temporary breakpoint 1 at 0x12be: file hello.c, line 35.
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello 'bart simpson'

Temporary breakpoint 1, main (argc=2, argv=0x7fffffffe798) at hello.c:35
35	  if (argc == 1) {
(gdb) n
40	    for (int i = 1; i < argc; i++) {
(gdb) 
41	      const char *name = argv[i];
(gdb) 
42	      char friendlyName[strlen(name)];
(gdb) 
43	      upcase_words(name, friendlyName);
(gdb) up
Initial frame selected; you cannot go up.
(gdb) b upcase_words 
Breakpoint 2 at 0x555555555195: file hello.c, line 13.
(gdb) p friendlt[K[KyName
No symbol "friendyName" in current context.
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) 
Bottom (innermost) frame selected; you cannot go down.
(gdb) l
38	  }
39	  else {
40	    for (int i = 1; i < argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
(gdb) c
Continuing.

Breakpoint 2, upcase_words (in=0x7fffffffeab1 "bart simpson", out=0x7fffffffe640 "\001")
    at hello.c:13
13	  int inWord = 0;
(gdb) n
14	  int n = strlen(in);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) p out
$1 = 0x7fffffffe640 "\001"
(gdb) p in
$2 = 0x7fffffffeab1 "bart simpson"
(gdb) 
$3 = 0x7fffffffeab1 "bart simpson"
(gdb) n
17	      out[i] = toupper(in[i]);
(gdb) p out
$4 = 0x7fffffffe640 "\001"
(gdb) n
22	    inWord = isalpha(in[i]);
(gdb) p out[90[K[K0]
$5 = 66 'B'
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) ou[K[Kp out[2]
$6 = 0 '\000'
(gdb) p out[1]
$7 = 97 'a'
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) p inWords
No symbol "inWords" in current context.
(gdb) p inWords[K
$8 = 1024
(gdb) n
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) u[Kout[K[K[Kp ont[K[K[Kin
$9 = 0x7fffffffeab1 "bart simpson"
(gdb) pi[K i
$10 = 2
(gdb) oug[Kt[K[K[Kp out[2] 
$11 = 0 '\000'
(gdb) 
$12 = 0 '\000'
(gdb) n
22	    inWord = isalpha(in[i]);
(gdb) p out [K[2]
$13 = 114 'r'
(gdb) p inWords[K
$14 = 1024
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) p out[4]
$15 = 32 ' '
(gdb) in[K[K
$16 = 32 ' '
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
17	      out[i] = toupper(in[i]);
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) p i
$17 = 8
(gdb) p out[8]
$18 = 112 'p'
(gdb) 
$19 = 112 'p'
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) p i
$20 = 11
(gdb) p out[11]
$21 = 110 'n'
(gdb) 
$22 = 110 'n'
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) 
24	}
(gdb) 
main (argc=2, argv=0x7fffffffe798) at hello.c:44
44	      say_hello(friendlyName);
(gdb) 
Hello Bart SimpsonUU
40	    for (int i = 1; i < argc; i++) {
(gdb) up
Initial frame selected; you cannot go up.
(gdb) say[K[K[Kb sya[K[Kay_hello 
Breakpoint 3 at 0x55555555528b: file hello.c, line 29.
(gdb) l
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
40	    for (int i = 1; i < argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
(gdb) b sya[K[Kay_hello 
Note: breakpoint 3 also set at pc 0x55555555528b.
Breakpoint 4 at 0x55555555528b: file hello.c, line 29.
(gdb) d
Delete all breakpoints? (y or n) n
(gdb) c
Continuing.
[Inferior 1 (process 11025) exited normally]
(gdb) r
Starting program: /import/linux/home1/rimai1/git-repos/i220b/work/lab3/ex2/hello 'bart simpson'

Breakpoint 2, upcase_words (in=0x7fffffffeab1 "bart simpson", out=0x7fffffffe640 "\001")
    at hello.c:13
13	  int inWord = 0;
(gdb) n
14	  int n = strlen(in);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
17	      out[i] = toupper(in[i]);
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) up
#1  0x0000555555555384 in main (argc=2, argv=0x7fffffffe798) at hello.c:43
43	      upcase_words(name, friendlyName);
(gdb) l
38	  }
39	  else {
40	    for (int i = 1; i < argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) up
#1  0x0000555555555384 in main (argc=2, argv=0x7fffffffe798) at hello.c:43
43	      upcase_words(name, friendlyName);
(gdb) b sa[K[K[K[Kn
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
20	      out[i] = in[i];
(gdb) 
22	    inWord = isalpha(in[i]);
(gdb) 
15	  for (int i = 0; i < n; i++) {
(gdb) 
16	    if (!inWord && isalpha(in[i])) {
(gdb) 
17	      out[i] = toupper(in[i]);
(gdb) c
Continuing.

Breakpoint 3, say_hello (name=0x7fffffffe640 "Bart SimpsonUU") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) na[K[Kp name
$23 = 0x7fffffffe640 "Bart SimpsonUU"
(gdb) w[Ky[Ksay[K[K[Kb [K[Kb say_hello 
Note: breakpoints 3 and 4 also set at pc 0x55555555528b.
Breakpoint 5 at 0x55555555528b: file hello.c, line 29.
(gdb) n
Hello Bart SimpsonUU
30	
(gdb) q\\\[K[K[K[Kn
main (argc=2, argv=0x7fffffffe798) at hello.c:40
40	   for (int i = 1; i < argc; i++) {
(gdb) 
47	 return 0;
(gdb) 
48	
(gdb) 
__libc_start_main (main=0x5555555552a6 <main>, argc=2, argv=0x7fffffffe798, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7fffffffe788) at ../csu/libc-start.c:342
342	../csu/libc-start.c: No such file or directory.
(gdb) q
A debugging session is active.

	Inferior 1 [process 12293] will be killed.

Quit anyway? (y or n) y
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ gdb hello./hello 'bart simpson' 'lisa simpson'make[K
cc -g -Wall -std=c99    hello.c   -o hello
[01m[Khello.c:[m[K In function ‘[01m[Ksay_hello[m[K’:
[01m[Khello.c:29:18:[m[K [01;35m[Kwarning: [m[Kformat ‘[01m[K%s[m[K’ expects argument of type ‘[01m[Kchar *[m[K’, but argument 2 has type ‘[01m[Kint[m[K’ [[01;35m[K-Wformat=[m[K]
   printf("Hello [01;35m[K%s[m[K\n", [32m[Kname[m[K);
                 [01;35m[K~^[m[K     [32m[K~~~~[m[K
                 [32m[K%d[m[K
[01m[Khello.c:[m[K In function ‘[01m[Kmain[m[K’:
[01m[Khello.c:44:17:[m[K [01;35m[Kwarning: [m[Kpassing argument 1 of ‘[01m[Ksay_hello[m[K’ makes integer from pointer without a cast [[01;35m[K-Wint-conversion[m[K]
       say_hello([01;35m[KfriendlyName[m[K);
                 [01;35m[K^~~~~~~~~~~~[m[K
[01m[Khello.c:27:16:[m[K [01;36m[Knote: [m[Kexpected ‘[01m[Kchar[m[K’ but argument is of type ‘[01m[Kchar *[m[K’
 say_hello([01;36m[Kchar name[m[K)
           [01;36m[K~~~~~^~~~[m[K
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ makegdb hello./hello 'bart simpson' 'lisa simpson'
Hello Bart SimpsonU
Hello Lisa SimpsonU
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./hello 'bart simpson' 'lisa simpson'make[K
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make./hello 'bart simpson' 'lisa simpson'
Hello Bart Simpson
Hello Lisa Simpson
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./hello 'bart simpson' 'lisa simpson'make[K
cc -g -Wall -std=c99    hello.c   -o hello
[01m[Khello.c:[m[K In function ‘[01m[Kupcase_words[m[K’:
[01m[Khello.c:14:17:[m[K [01;35m[Kwarning: [m[K‘[01m[Ksizeof[m[K’ on array function parameter ‘[01m[Kin[m[K’ will return size of ‘[01m[Kconst char *[m[K’ [[01;35m[K-Wsizeof-array-argument[m[K]
   int n = sizeof[01;35m[K([m[Kin);
                 [01;35m[K^[m[K
[01m[Khello.c:11:25:[m[K [01;36m[Knote: [m[Kdeclared here
 upcase_words([01;36m[Kconst char in[][m[K, char out[])
              [01;36m[K~~~~~~~~~~~^~~~[m[K
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make[Kmake./hello 'bart simpson' 'lisa simpson'
Hello Bart SimpsBK9V
Hello Lisa SimpsBK9V
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./hello 'bart simpson' 'lisa simpson'make[K
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make./hello 'bart simpson' 'lisa simpson'
Hello Bart Simpso,zU
Hello Lisa Simpso,zU
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./hello 'bart simpson' 'lisa simpson'make[K
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make./hello 'bart simpson' 'lisa simpson'
Hello Bart SimpsonU
Hello Lisa SimpsonU
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ ./hello 'bart simpson' 'lisa simpson'make[K
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ make./hello 'bart simpson' 'lisa simpson'
Hello Bart Simpson
Hello Lisa Simpson
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ po[K[Kmi[K[Kki[K[Kma[K[Kk[Kk[Kcd[K[Kl[Kp[Kgedit hello.c

(gedit:15707): Gtk-[1;33mWARNING[0m **: [34m17:06:59.671[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

[1]+  Done                    gedit hello.c
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ gedit hello.c./hello 'bart simpson' 'lisa simpson'make[K./hello 'bart simpson' 'lisa simpson'make[K
cc -g -Wall -std=c99    hello.c   -o hello
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ makegedit hello.c./hello 'bart simpson' 'lisa simpson'
Hello Bart Simpson
Hello Lisa Simpson
rimai1@g7-33:~/git-repos/i220b/work/lab3/ex2$ exit

Script done on 2019-09-05 17:07:43-04:00 [COMMAND_EXIT_CODE="0"]
